foamfiles/counterFlowFlame2D/case_150/system/Obselete/blockMeshDict_Template
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
/* Cookstove body geometry:*/
pt1 // vertex 0
pt2 // vertex 1
pt3 // vertex 2
pt4 // vertex 3
pt5 // vertex 4
pt6 // vertex 5
pt7 // vertex 6
pt8 // vertex 7
pt9 // vertex 8
pt10 // vertex 9
pt11 // vertex 10
pt12 // vertex 11
pt13 // vertex 12
pt14 // vertex 13
pt15 // vertex 14
pt16 // vertex 15

/*Fuel Zone:*/
pt17 // vertex 16
pt18 // vertex 17
pt19 // vertex 18
pt20 // vertex 19

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fuel
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    air
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (7 6 2 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
